# Command-line tools (Formulae)
brew "git"
brew "go"
brew "node"
brew "starship"
brew "stow"
brew "vim"
brew "tree"
brew "fastfetch"
brew "tmux"
brew "pandoc"
brew "ncdu"
brew "gh"
brew "lazygit"
brew "kubectl"
brew "helm"

# Development Applications (Casks)
cask "vscodium"
cask "docker"
cask "postman"
cask "kitty"
cask "alacritty"
cask "google-chrome"
cask "firefox"
cask "discord"
