# Command-line tools (Formulae)
brew "go"
brew "node"
brew "starship"
brew "stow"
brew "vim"
brew "tree"
brew "fastfetch"
brew "tmux"
brew "pandoc"
brew "ncdu"
brew "gh"
brew "lazygit"
brew "kubectl"
brew "helm"
brew "tokei"
brew "fish"
brew "cbonsai"
brew "zoxide"
brew "fzf"
brew "parallel"
brew "ranger"
brew "neovim"

# Development Applications (Casks)
cask "vscodium"
cask "docker"
cask "postman"
cask "kitty"
cask "alacritty"
cask "google-chrome"
cask "firefox"
cask "discord"
cask "zed"
cask "ghostty"
