# Command-line tools (Formulae)
brew "go"            # Go programming language
brew "node"          # JavaScript runtime
brew "starship"      # Customizable shell prompt
brew "stow"          # Symlink manager for dotfiles
brew "vim"           # Standard text editor
brew "tree"          # Display directories as trees
brew "fastfetch"     # System info fetcher (faster Neofetch)
brew "tmux"          # Terminal multiplexer
brew "pandoc"        # Universal document converter
brew "ncdu"          # Disk usage analyzer
brew "gh"            # GitHub CLI
brew "lazygit"       # Terminal UI for Git
brew "kubectl"       # Kubernetes CLI
brew "helm"          # Kubernetes package manager
brew "tokei"         # Count lines of code (Rust)
brew "fish"          # User-friendly shell
brew "cbonsai"       # ASCII bonsai tree generator
brew "zoxide"        # Smarter 'cd' navigation
brew "fzf"           # Command-line fuzzy finder
brew "parallel"      # Execute jobs in parallel
brew "ranger"        # Console file manager
brew "neovim"        # Modern Vim-based editor
brew "tldr"          # Simplified man pages

# Development Applications (Casks)
cask "vscodium"      # Open-source VS Code (no telemetry)
cask "docker"        # Containerization platform
cask "postman"       # API development tool
cask "kitty"         # GPU-based terminal emulator
cask "alacritty"     # Rust-based terminal emulator
cask "google-chrome" # Web browser
cask "firefox"       # Web browser
cask "discord"       # Chat and community app
cask "zed"           # High-performance code editor
cask "ghostty"       # Modern, native terminal
